Autodesk.Revit.DB.ElementLevelFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id.
levelId:
The id of the level that will be matched to elements' associated level.
inverted:
True if the filter should match all elements not associated to the given level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementLevelFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of an ElementLevelFilter.
levelId:
The id of the level that will be matched to elements' associated level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011